aula-002/backend/app/controllers/enquetes_controller.rb

  def index
    beers = Enquete.where(beer: 1).count
    milks = Enquete.where(milk: 1).count
---
SELECT COUNT(*) FROM "enquetes" WHERE "enquetes"."beer" = ?  [["beer", 1]]
SELECT COUNT(*) FROM "enquetes" WHERE "enquetes"."milk" = ?  [["milk", 1]]

  def create
    @enquete = Enquete.new(enquete_params)

    if @enquete.save
---
INSERT INTO "enquetes" ("milk", "created_at", "updated_at") VALUES (?, ?, ?)  [["milk", 1], ["created_at", "2019-08-25 03:38:29.836958"], ["updated_at", "2019-08-25 03:38:29.836958"]]